import requests
from parsers.wiki_parser import WikiParser


url = "https://ru.wikipedia.org/w/api.php?action=query&format=json&list=search&utf8=1&srsearch="
suf_url = ""

request_list = ["Россия",
                "Путин, Владимир Владимирович",
                "Отряд самоубийц (фильм, 2016)",
                "Игра престолов (телесериал)",
                "Трамп, Дональд",
                "YouTube",
                "Чемпионат Европы по футболу 2016",
                "Ди Каприо, Леонардо",
                "ВКонтакте",
                "Летние Олимпийские игры 2016",
                "Одноклассники (социальная сеть)",
                "Соединённые Штаты Америки",
                "Список умерших в 2016 году",
                "Москва",
                "Первая мировая война",
                "Пушкин, Александр Сергеевич",
                "Президентские выборы в США (2016)",
                "Гомункул",
                "Криштиану Роналду",
                "Санкт-Петербург",
                "Сталин, Иосиф Виссарионович",
                "Евровидение-2016",
                "Украина",
                "Дэдпул",
                "Союз Советских Социалистических Республик",
                "Нагиев, Дмитрий Владимирович",
                "Великобритания",
                "Джоли, Анджелина",
                "Гитлер, Адольф",
                "Люди Икс (серия фильмов)",
                "Википедия",
                "Депп, Джонни",
                "Ленин, Владимир Ильич",
                "Вторая мировая война",
                "Пётр I",
                "Тимати",
                "Прилучный, Павел Валерьевич",
                "Список фильмов по комиксам Marvel Comics",
                "Харли Квинн",
                "Дэдпул (фильм)",
                "Труд",
                "Звёздные войны",
                "Первый мститель: Противостояние",
                "Единый реестр запрещённых сайтов",
                "Китайская Народная Республика",
                "Робби, Марго",
                "Бэтмен против Супермена: На заре справедливости",
                "Сулейман I",
                "Макгрегор, Конор",
                "Шерлок (телесериал)"]

for i in range(len(request_list)):

    full_url = url + request_list[i] + suf_url
    file_name = "../../golden/wiki/" + str(i)
    """
    response = requests.get(full_url)
    with open(file_name + ".json", "w") as file:
        file.write(response.text)
    """
    print("i =", i)
    parser = WikiParser()
    with open(file_name + "_result.json", "w") as file:
        with open(file_name + ".json", "r") as input:
            file.write(str(parser.parse(input.read())))
    with open(file_name + "_markup.json", "w") as file:
        file.write(str(parser.extract_markup(file_name + ".json")))
