import requests

url = "https://market.yandex.ru/search?cvredirect=2&text="
suf_url = "&local-offers-first=0&deliveryincluded=0&onstock=1"

request_list = ["телефон",
                "смартфон",
                "яндекс%20маркет",
                "одноклассники.мобильная%20версия",
                "спорт%20экспресс",
                "скачать%20музыку",
                "поздравления%20с%20днем%20рождения",
                "онлайн%20переводчик",
                "карта%20метро",
                "расписание%20электричек",
                "игры%20онлайн",
                "яндекс%20пробки",
                "смотреть%20фильм",
                "скачать%20музыку%20бесплатно",
                "программа%20тв",
                "прогноз%20погоды",
                "отслеживание%20почтовых%20отправлений",
                "курс%20доллара",
                "фотошоп%20онлайн",
                "точное%20время",
                "теория%20большого%20взрыва",
                "с%20днем%20рождения",
                "эротические%20рассказы",
                "электронный%20журнал",
                "скачать%20игры",
                "карта%20москвы",
                "футбол%20онлайн",
                "сбербанк%20бизнес%20онлайн",
                "расписание%20поездов",
                "работа%20в%20москве",
                "маша%20и%20медведь%20все%20серии",
                "гороскоп%20на%20сегодня",
                "скачать%20фильмы",
                "скачать%20бесплатно%20музыку",
                "санкт%20петербург",
                "продажа%20авто",
                "игровые%20автоматы",
                "сайт%20знакомств",
                "обои%20для%20рабочего%20стола",
                "кредитный%20калькулятор",
                "конвертер%20валют",
                "яндекс%20переводчик",
                "совместные%20покупки",
                "свадебные%20платья",
                "игры%20бесплатно",
                "пдд%20онлайн",
                "новости%20украины",
                "дешевые%20авиабилеты",
                "работа%20на%20дому",
                "смотреть%20фильмы"]

for i in range(1):#len(request_list)):

    full_url = url + request_list[i] + suf_url
    file_name = "../../golden/yandex_market/" + str(i)

    response = requests.get(full_url)
    with open(file_name + ".html", "w") as file:
        file.write(response.text)
    print("i =", i)
    """
    parser = YandexParser_v3()
    with open(file_name + ".json", "w") as file:
        with open(file_name + ".html", "r") as input:
            file.write(str(parser.parse(input.read())))
    with open(file_name + "_markup.json", "w") as file:
        file.write(str(parser.extract_markup(file_name + ".html")))
    """